wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/SDIO/eMMC_readwrite/emmc.c
/*!
    \file    emmc.c
    \brief   eMMC driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "emmc.h"
#include "gd32h77x_sdio.h"
#include <stddef.h>
#include <string.h>

/* card status of R1 definitions */
#define EMMC_R1_OUT_OF_RANGE                  BIT(31)                   /* command's argument was out of the allowed range */
#define EMMC_R1_ADDRESS_ERROR                 BIT(30)                   /* misaligned address which did not match the block length */
#define EMMC_R1_BLOCK_LEN_ERROR               BIT(29)                   /* transferred block length is not allowed */
#define EMMC_R1_ERASE_SEQ_ERROR               BIT(28)                   /* an error in the sequence of erase commands occurred */
#define EMMC_R1_ERASE_PARAM                   BIT(27)                   /* an invalid selection of write-blocks for erase occurred */
#define EMMC_R1_WP_VIOLATION                  BIT(26)                   /* the host attempts to write to a protected block or to the temporary or permanent write protected card */
#define EMMC_R1_CARD_IS_LOCKED                BIT(25)                   /* the card is locked by the host */
#define EMMC_R1_LOCK_UNLOCK_FAILED            BIT(24)                   /* a sequence or password error has been detected in lock/unlock card command */
#define EMMC_R1_COM_CRC_ERROR                 BIT(23)                   /* CRC check of the previous command failed */
#define EMMC_R1_ILLEGAL_COMMAND               BIT(22)                   /* command not legal for the card state */
#define EMMC_R1_CARD_ECC_FAILED               BIT(21)                   /* card internal ECC was applied but failed to correct the data */
#define EMMC_R1_CC_ERROR                      BIT(20)                   /* internal card controller error */
#define EMMC_R1_GENERAL_UNKNOWN_ERROR         BIT(19)                   /* a general or an unknown error occurred during the operation */
#define EMMC_R1_CSD_OVERWRITE                 BIT(16)                   /* read only section of the CSD does not match or attempt to reverse the copy or permanent WP bits */
#define EMMC_R1_WP_ERASE_SKIP                 BIT(15)                   /* partial address space was erased */
#define EMMC_R1_CARD_ECC_DISABLED             BIT(14)                   /* command has been executed without using the internal ECC */
#define EMMC_R1_ERASE_RESET                   BIT(13)                   /* an erase sequence was cleared before executing */
#define EMMC_R1_READY_FOR_DATA                BIT(8)                    /* correspond to buffer empty signaling on the bus */
#define EMMC_R1_APP_CMD                       BIT(5)                    /* card will expect ACMD */
#define EMMC_R1_AKE_SEQ_ERROR                 BIT(3)                    /* error in the sequence of the authentication process */
#define EMMC_R1_ERROR_BITS                    ((uint32_t)0xFDF9E008U)   /* all the R1 error bits */

/* card status of R6 definitions */
#define EMMC_R6_COM_CRC_ERROR                 BIT(15)                   /* CRC check of the previous command failed */
#define EMMC_R6_ILLEGAL_COMMAND               BIT(14)                   /* command not legal for the card state */
#define EMMC_R6_GENERAL_UNKNOWN_ERROR         BIT(13)                   /* a general or an unknown error occurred during the operation */

/* card state */
#define EMMC_CARDSTATE_IDLE                   ((uint8_t)0x00)           /* eMMC is in idle state */
#define EMMC_CARDSTATE_READY                  ((uint8_t)0x01)           /* eMMC is in ready state */
#define EMMC_CARDSTATE_IDENTIFICAT            ((uint8_t)0x02)           /* eMMC is in identificat state */
#define EMMC_CARDSTATE_STANDBY                ((uint8_t)0x03)           /* eMMC is in standby state */
#define EMMC_CARDSTATE_TRANSFER               ((uint8_t)0x04)           /* eMMC is in transfer state */
#define EMMC_CARDSTATE_DATA                   ((uint8_t)0x05)           /* eMMC is in data sending state */
#define EMMC_CARDSTATE_RECEIVING              ((uint8_t)0x06)           /* eMMC is in receiving state */
#define EMMC_CARDSTATE_PROGRAMMING            ((uint8_t)0x07)           /* eMMC is in programming state */
#define EMMC_CARDSTATE_DISCONNECT             ((uint8_t)0x08)           /* eMMC is in disconnect state */
#define EMMC_CARDSTATE_LOCKED                 ((uint32_t)0x02000000U)   /* eMMC is in locked state */

/* eMMC bus width, check SCR register */
#define EMMC_BUS_WIDTH_8BIT                   ((uint32_t)0x00000002U)    /* 8-bit width bus mode */
#define EMMC_BUS_WIDTH_4BIT                   ((uint32_t)0x00000001U)    /* 4-bit width bus mode */
#define EMMC_BUS_WIDTH_1BIT                   ((uint32_t)0x00000000U)    /* 1-bit width bus mode */

/* masks for SCR register */
#define EMMC_MASK_0_7BITS                     ((uint32_t)0x000000FFU)    /* mask [7:0] bits */
#define EMMC_MASK_8_15BITS                    ((uint32_t)0x0000FF00U)    /* mask [15:8] bits */
#define EMMC_MASK_16_23BITS                   ((uint32_t)0x00FF0000U)    /* mask [23:16] bits */
#define EMMC_MASK_24_31BITS                   ((uint32_t)0xFF000000U)    /* mask [31:24] bits */

#define SDIO_FIFO_ADDR                        SDIO_FIFO(SDIO)            /* address of SDIO_FIFO */
#define EMMC_FIFOHALF_WORDS                   ((uint32_t)0x00000008U)    /* words of FIFO half full/empty */
#define EMMC_FIFOHALF_BYTES                   ((uint32_t)0x00000020U)    /* bytes of FIFO half full/empty */

#define EMMC_DATATIMEOUT                      ((uint32_t)0xFFFFFFFFU)    /* DSM data timeout */
#define EMMC_MAX_VOLT_VALIDATION              ((uint32_t)0x0000FFFFU)    /* the maximum times of voltage validation */
#define EMMC_MAX_DATA_LENGTH                  ((uint32_t)0x01FFFFFFU)    /* the maximum length of data */
#define EMMC_ALLZERO                          ((uint32_t)0x00000000U)    /* all zero */
#define EMMC_RCA_SHIFT                        ((uint8_t)0x10U)           /* RCA shift bits */

#define EMMC_CLK_DIV_INIT                     ((uint16_t)0x01F4)        /* eMMC clock division in initilization phase */
#define EMMC_CLK_DIV_TRANS_DSPEED             ((uint16_t)0x0008)        /* eMMC clock division in default speed transmission phase */
#define EMMC_CLK_DIV_TRANS_HSPEED             ((uint16_t)0x0002)        /* eMMC clock division in high speed transmission phase */

#define SDIO_MASK_INTC_FLAGS                  ((uint32_t)0x1FE00FFF)    /* mask flags of SDIO_INTC */
#define SDIO_MASK_CMD_FLAGS                   ((uint32_t)0x002000C5)    /* mask flags of  CMD FLAGS */
#define SDIO_MASK_DATA_FLAGS                  ((uint32_t)0x18000F3A)    /* mask flags of  DATA FLAGS */

uint32_t emmc_csd[4] = {0, 0, 0, 0};                                   /* content of CSD register */
uint32_t emmc_cid[4] = {0, 0, 0, 0};                                   /* content of CID register */
uint8_t  emmc_extcsd[512] = {0};                                       /* content of CSD register */
uint16_t emmc_rca = 0U;                                         /* RCA of eMMC card */
static uint32_t transmode = EMMC_POLLING_MODE;
static uint32_t totalnumber_bytes = 0U, stopcondition = 0U;

