wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/SDIO/eMMC_readwrite/emmc.c
static __IO emmc_error_enum transerror = EMMC_OK;
static __IO uint32_t transend = 0U, number_bytes = 0U;

/* check if the command sent error occurs */
static emmc_error_enum cmdsent_error_check(void);
/* check if error occurs for R1 response */
static emmc_error_enum r1_error_check(uint8_t cmdindex);
/* check if error type for R1 response */
static emmc_error_enum r1_error_type_check(uint32_t resp);
/* check if error occurs for R2 response */
static emmc_error_enum r2_error_check(void);
/* check if error occurs for R3 response */
static emmc_error_enum r3_error_check(void);

/* get the state which the card is in */
static emmc_error_enum emmc_card_state_get(uint8_t *pcardstate);
/* configure the bus width mode */
static emmc_error_enum emmc_bus_width_config(uint32_t buswidth);
/* get the data block size */
static uint32_t emmc_datablocksize_get(uint16_t bytesnumber);

/* configure the GPIO of SDIO interface */
static void gpio_config(void);
/* configure the RCU of SDIO */
static void rcu_config(void);
/* configure the DMA for SDIO request */
static void dma_config(uint32_t *srcbuf, uint32_t bufsize);

/*!
    \brief      initialize the eMMC card and make it in standby state
    \param[in]  none
    \param[out] none
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_init(void)
{
    emmc_error_enum status = EMMC_OK;
    /* configure the RCU and GPIO, deinitialize the SDIO */
    rcu_config();
    gpio_config();
    sdio_deinit(SDIO);

    /* configure the clock and work voltage */
    status = emmc_power_on();
    if(EMMC_OK != status) {
        return status;
    }

    /* initialize the card and get CID and CSD of the card */
    status = emmc_card_init();
    if(EMMC_OK != status) {
        return status;
    }

    /* configure the SDIO peripheral */
    sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKPWRSAVE_DISABLE, EMMC_CLK_DIV_INIT);
    sdio_bus_mode_set(SDIO, SDIO_BUSMODE_1BIT);
    sdio_hardware_clock_disable(SDIO);

    return status;
}

/*!
    \brief      initialize the card and get CID and CSD of the card
    \param[in]  none
    \param[out] none
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_card_init(void)
{
    emmc_error_enum status = EMMC_OK;

    if(SDIO_POWER_OFF == sdio_power_state_get(SDIO)) {
        status = EMMC_OPERATION_IMPROPER;
        return status;
    }

    /* send CMD2(EMMC_CMD_ALL_SEND_CID) to get the CID numbers */
    sdio_command_response_config(SDIO, EMMC_CMD_ALL_SEND_CID, (uint32_t)0x0, SDIO_RESPONSETYPE_LONG);
    sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
    sdio_csm_enable(SDIO);
    /* check if some error occurs */
    status = r2_error_check();

    if(EMMC_OK != status) {
        return status;
    }

    /* store the CID numbers */
    emmc_cid[0] = sdio_response_get(SDIO, SDIO_RESPONSE0);
    emmc_cid[1] = sdio_response_get(SDIO, SDIO_RESPONSE1);
    emmc_cid[2] = sdio_response_get(SDIO, SDIO_RESPONSE2);
    emmc_cid[3] = sdio_response_get(SDIO, SDIO_RESPONSE3);

    /* send CMD3(SEND_RELATIVE_ADDR) to ask the eMMC to publish a new relative address (RCA) */
    sdio_command_response_config(SDIO, EMMC_CMD_SEND_RELATIVE_ADDR, (uint32_t)emmc_rca << 16U, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
    sdio_csm_enable(SDIO);
    /* check if some error occurs */
    status = r1_error_check(EMMC_CMD_SEND_RELATIVE_ADDR);
    if(EMMC_OK != status) {
        return status;
    }

    /* send CMD9(SEND_CSD) to get the addressed card's card-specific data (CSD) */
    sdio_command_response_config(SDIO, EMMC_CMD_SEND_CSD, (uint32_t)(emmc_rca << EMMC_RCA_SHIFT), SDIO_RESPONSETYPE_LONG);
    sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
    sdio_csm_enable(SDIO);
    /* check if some error occurs */
    status = r2_error_check();
    if(EMMC_OK != status) {
        return status;
    }
    /* store the card-specific data (CSD) */
    emmc_csd[0] = sdio_response_get(SDIO, SDIO_RESPONSE0);
    emmc_csd[1] = sdio_response_get(SDIO, SDIO_RESPONSE1);
    emmc_csd[2] = sdio_response_get(SDIO, SDIO_RESPONSE2);
    emmc_csd[3] = sdio_response_get(SDIO, SDIO_RESPONSE3);

    return status;
}

/*!
    \brief      configure the clock and the work voltage, and get the card type
    \param[in]  none
    \param[out] none
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_power_on(void)
{
    emmc_error_enum status = EMMC_OK;
    uint32_t response = 0U;
    uint32_t timedelay = 0U;

    /* configure the SDIO peripheral */
    sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKPWRSAVE_DISABLE, EMMC_CLK_DIV_INIT);
    sdio_bus_mode_set(SDIO, SDIO_BUSMODE_1BIT);
    sdio_hardware_clock_disable(SDIO);
    sdio_power_state_set(SDIO, SDIO_POWER_ON);

    /* time delay for power up*/
    timedelay = 500U;
    while(timedelay > 0U) {
        timedelay--;
    }

    /* send CMD0(GO_IDLE_STATE) to reset the card */
    sdio_command_response_config(SDIO, EMMC_CMD_GO_IDLE_STATE, (uint32_t)0x0, SDIO_RESPONSETYPE_NO);
    sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
    /* enable the CSM */
    sdio_csm_enable(SDIO);

    /* check if command sent error occurs */
    status = cmdsent_error_check();
    if(EMMC_OK != status) {
        return status;
    }

    timedelay = 0x4000U;
    while(timedelay--) {
        sdio_command_response_config(SDIO, EMMC_CMD_SEND_OP_COND, (uint32_t)0x40ff8000, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
        /* enable the CSM */
        sdio_csm_enable(SDIO);

        /* check if some error occurs */
        status = r3_error_check();
        if(EMMC_OK != status) {
            return status;
        }
        if(!timedelay) {
            status = EMMC_ERROR;
            return status;
        }

        /* get the response and check card power up status bit(busy) */
        response = sdio_response_get(SDIO, SDIO_RESPONSE0);
        if(0x80000000 == (response & 0x80000000)) {
            break;
        } else {
            continue;
        }
    }
    return status;
}

/*!
    \brief      close the power of SDIO
    \param[in]  none
    \param[out] none
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_power_off(void)
{
    emmc_error_enum status = EMMC_OK;
    sdio_power_state_set(SDIO, SDIO_POWER_OFF);
    return status;
}

/*!
    \brief      configure the bus mode
    \param[in]  busmode: the bus mode
      \arg        SDIO_BUSMODE_1BIT: 1-bit SDIO card bus mode
      \arg        SDIO_BUSMODE_4BIT: 4-bit SDIO card bus mode
      \arg        SDIO_BUSMODE_8BIT: 8-bit SDIO card bus mode
     \param[in]  datarate: the data rate mode
      \arg        SDIO_DATA_RATE_SDR:  1/4/8 bits bus data SDR selected
      \arg        SDIO_DATA_RATE_DDR:  4/8 bits bus data DDR selected
    \param[out] none
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_bus_mode_config(uint32_t busmode, uint32_t datarate)
{
    emmc_error_enum status = EMMC_OK;

    /* send CMD13(SEND_STATUS), addressed card sends its status registers */
    sdio_command_response_config(SDIO, EMMC_CMD_SEND_STATUS, (uint32_t)emmc_rca << EMMC_RCA_SHIFT, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
    sdio_csm_enable(SDIO);
    /* check if some error occurs */
    status = r1_error_check(EMMC_CMD_SEND_STATUS);
    if(EMMC_OK != status) {
        return status;
    }

    if(SDIO_DATA_RATE_DDR == datarate) {
        /* send CMD6(EMMC_CMD_SWITCH) to set the width */
        sdio_command_response_config(SDIO, EMMC_CMD_SWITCH_FUNC, (uint32_t)0x03B90100, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
        /* enable the CSM */
        sdio_csm_enable(SDIO);

        /* check if some error occurs */
        status = r1_error_check(EMMC_CMD_SWITCH_FUNC);
        if(EMMC_OK != status) {
            return status;
        }

