wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/SDIO/eMMC_readwrite/emmc.c
        if(SDIO_BUSMODE_8BIT == busmode) {
            /* send CMD6(EMMC_CMD_SWITCH) to set the width */
            sdio_command_response_config(SDIO, EMMC_CMD_SWITCH_FUNC, (uint32_t)0x03B70600, SDIO_RESPONSETYPE_SHORT);
            sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
            /* enable the CSM */
            sdio_csm_enable(SDIO);

            /* check if some error occurs */
            status = r1_error_check(EMMC_CMD_SWITCH_FUNC);
            if(EMMC_OK != status) {
                return status;
            }
            /* configure eMMC bus width and the SDIO */
            status = emmc_bus_width_config(EMMC_BUS_WIDTH_8BIT);
            if(EMMC_OK == status) {
                sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_FALLING, SDIO_CLOCKPWRSAVE_DISABLE, EMMC_CLK_DIV_TRANS_DSPEED);
                sdio_bus_mode_set(SDIO, busmode);
                sdio_data_rate_set(SDIO, SDIO_DATA_RATE_DDR);
                sdio_bus_speed_set(SDIO, SDIO_BUSSPEED_HIGH);
                sdio_hardware_clock_enable(SDIO);
            }
        } else if(SDIO_BUSMODE_4BIT == busmode) {
            /* send CMD6(EMMC_CMD_SWITCH) to set the width */
            sdio_command_response_config(SDIO, EMMC_CMD_SWITCH_FUNC, (uint32_t)0x03B70500, SDIO_RESPONSETYPE_SHORT);
            sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
            /* enable the CSM */
            sdio_csm_enable(SDIO);

            /* check if some error occurs */
            status = r1_error_check(EMMC_CMD_SWITCH_FUNC);
            if(EMMC_OK != status) {
                return status;
            }
            /* configure eMMC bus width and the SDIO */
            status = emmc_bus_width_config(EMMC_BUS_WIDTH_4BIT);
            if(EMMC_OK == status) {
                sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_FALLING, SDIO_CLOCKPWRSAVE_DISABLE, EMMC_CLK_DIV_TRANS_DSPEED);
                sdio_bus_mode_set(SDIO, busmode);
                sdio_data_rate_set(SDIO, SDIO_DATA_RATE_DDR);
                sdio_bus_speed_set(SDIO, SDIO_BUSSPEED_HIGH);
                sdio_hardware_clock_enable(SDIO);
            }
        } else {
            status = EMMC_PARAMETER_INVALID;
        }
    } else if(SDIO_DATA_RATE_SDR == datarate) {
        if(SDIO_BUSMODE_8BIT == busmode) {
            /* send CMD6(EMMC_CMD_SWITCH) to set the width */
            sdio_command_response_config(SDIO, EMMC_CMD_SWITCH_FUNC, (uint32_t)0x03B70200, SDIO_RESPONSETYPE_SHORT);
            sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
            /* enable the CSM */
            sdio_csm_enable(SDIO);

            /* check if some error occurs */
            status = r1_error_check(EMMC_CMD_SWITCH_FUNC);
            if(EMMC_OK != status) {
                return status;
            }

            /* configure eMMC bus width and the SDIO */
            status = emmc_bus_width_config(EMMC_BUS_WIDTH_8BIT);
            if(EMMC_OK == status) {
                sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKPWRSAVE_DISABLE, EMMC_CLK_DIV_TRANS_DSPEED);
                sdio_bus_mode_set(SDIO, busmode);
                sdio_hardware_clock_enable(SDIO);
            }
        } else if(SDIO_BUSMODE_4BIT == busmode) {
            /* send CMD6(EMMC_CMD_SWITCH) to set the width */
            sdio_command_response_config(SDIO, EMMC_CMD_SWITCH_FUNC, (uint32_t)0x03B70100, SDIO_RESPONSETYPE_SHORT);
            sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
            /* enable the CSM */
            sdio_csm_enable(SDIO);

            /* check if some error occurs */
            status = r1_error_check(EMMC_CMD_SWITCH_FUNC);
            if(EMMC_OK != status) {
                return status;
            }
            /* configure eMMC bus width and the SDIO */
            status = emmc_bus_width_config(EMMC_BUS_WIDTH_4BIT);
            if(EMMC_OK == status) {
                sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKPWRSAVE_DISABLE, EMMC_CLK_DIV_TRANS_DSPEED);
                sdio_bus_mode_set(SDIO, busmode);
                sdio_hardware_clock_enable(SDIO);
            }
        } else if(SDIO_BUSMODE_1BIT == busmode) {
            /* configure eMMC bus width and the SDIO */
            status = emmc_bus_width_config(EMMC_BUS_WIDTH_1BIT);
            if(EMMC_OK == status) {
                sdio_clock_config(SDIO, SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKPWRSAVE_DISABLE, EMMC_CLK_DIV_TRANS_DSPEED);
                sdio_bus_mode_set(SDIO, busmode);
                sdio_hardware_clock_enable(SDIO);
            }
        } else {
            status = EMMC_PARAMETER_INVALID;
        }
    } else {
        status = EMMC_PARAMETER_INVALID;
    }
    sdio_flag_clear(SDIO, SDIO_MASK_INTC_FLAGS);
    return status;
}

/*!
    \brief      configure the mode of transmission
    \param[in]  txmode: transfer mode
      \arg        EMMC_DMA_MODE: DMA mode
      \arg        EMMC_POLLING_MODE: polling mode
    \param[out] none
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_transfer_mode_config(uint32_t txmode)
{
    emmc_error_enum status = EMMC_OK;
    /* set the transfer mode */
    if((EMMC_DMA_MODE == txmode) || (EMMC_POLLING_MODE == txmode)) {
        transmode = txmode;
    } else {
        status = EMMC_PARAMETER_INVALID;
    }
    return status;
}

/*!
    \brief      read a block data into a buffer from the specified address of a card
    \param[out] preadbuffer: a pointer that store a block read data
    \param[in]  readaddr: the read data address
    \param[in]  blocksize: the data block size
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_block_read(uint32_t *preadbuffer, uint32_t readaddr, uint16_t blocksize)
{
    /* initialize the variables */
    emmc_error_enum status = EMMC_OK;
    uint32_t count = 0U, align = 0U, datablksize = SDIO_DATABLOCKSIZE_1BYTE, *ptempbuff = preadbuffer;
    __IO uint32_t timeout = 0U;

    if(NULL == preadbuffer) {
        status = EMMC_PARAMETER_INVALID;
        return status;
    }

    transerror = EMMC_OK;
    transend = 0U;
    totalnumber_bytes = 0U;
    /* clear all DSM configuration */
    sdio_data_config(SDIO, 0U, 0U, SDIO_DATABLOCKSIZE_1BYTE);
    sdio_data_transfer_config(SDIO, SDIO_TRANSMODE_BLOCKCOUNT, SDIO_TRANSDIRECTION_TOCARD);
    sdio_dsm_disable(SDIO);
    sdio_idma_disable(SDIO);

